var str = prompt('Введите свое имя :');
console.log('Меня ' + 'зовут ' + (str));

var str = +prompt('Введите свой возраст :');
console.log('Мне '+ (str));

var str = prompt('Решите пример ' + '5 + 3 = ?');
console.log('Пример 1:' + (' 5 + 3 = ' + (5 + 3)) + ' (Ваш ответ: ' +(str) +")");

var str = prompt('Решите пример ' + ' 10 - 5 = ?');
console.log('Пример 2:' + (' 10 - 5 = ' + (10 - 5)) + ' (Ваш ответ: ' +(str) +")");

var str = prompt('Решите пример ' + ' 2 * 3 = ?');
console.log('Пример 3:' + (' 2 * 3 = ' + 2 * 3) + ' (Ваш ответ: ' +(str) +")");

var str = prompt('Решите пример ' + ' 8 / 2 = ?');
console.log('Пример 4:' + (' 8 / 2 = ' + 8 / 2) + ' (Ваш ответ: ' +(str) +")");

var str = prompt('Решите пример ' + ' 10 % 3 = ?');
console.log('Пример 5:' + (' 10 % 3 = ' + 10 % 3) + ' (Ваш ответ: ' +(str) +")");

alert('Откройте консоль для просмотра');